## More Advanced Pandas

In [1]:
# Load the Pandas package for use in this notebook
import pandas as pd

### Data Normalisation

We may often want to scale numeric values in a Data Frame to conform to minimum and maximum values.

In [2]:
df = pd.DataFrame({"home":[0,3,2,4,2,1],"away":[0,1,0,2,0,0]})
df

   away  home
0     0     0
1     1     3
2     0     2
3     2     4
4     0     2
5     0     1

We can apply simple arithmetic operations to scale numeric Data Frames:

In [3]:
df / 10

   away  home
0   0.0   0.0
1   0.1   0.3
2   0.0   0.2
3   0.2   0.4
4   0.0   0.2
5   0.0   0.1

This allows us to easily normalise our data in different ways. For instance, we can subtract the mean column values from each row in the data frame:

In [4]:
df - df.mean()

   away  home
0  -0.5  -2.0
1   0.5   1.0
2  -0.5   0.0
3   1.5   2.0
4  -0.5   0.0
5  -0.5  -1.0

We could also divide each row by maximum value for each column

In [5]:
ndf = df - df.max()
ndf

   away  home
0    -2    -4
1    -1    -1
2    -2    -2
3     0     0
4    -2    -2
5    -2    -3

If we have made any modifications to a Data Frame, we can export the data as a new CSV file using the *to_csv()* function.

In [6]:
ndf.to_csv("modified.csv")

### Aggregating Data

Let's try a simple example of aggregating data stored in a Data Frame. This aggregation is based on a categorical value in each row.

In [7]:
df = pd.DataFrame({"Name":["E. Kenny","M. Martin","L. Varadkar","N. Collins","J. Burton"], 
                   "Party":["Fine Gael","Fianna Fail","Fine Gael", "Fianna Fail", "Labour"],
                   "Tweets": [ 399, 938, 1830, 1946, 907 ]})
df

          Name        Party  Tweets
0     E. Kenny    Fine Gael     399
1    M. Martin  Fianna Fail     938
2  L. Varadkar    Fine Gael    1830
3   N. Collins  Fianna Fail    1946
4    J. Burton       Labour     907

We will group the rows (i.e. the politicians) using the "Party" columns

In [8]:
groups = df.groupby("Party")


We can now apply the *sum()* function to get the total sum of tweets for each party:

In [9]:
groups.sum()

             Tweets
Party
Fianna Fail    2884
Fine Gael      2229
Labour          907

We can also get the mean number of tweets for each party:

In [10]:
groups.mean()

             Tweets
Party
Fianna Fail  1442.0
Fine Gael    1114.5
Labour        907.0

As a second example, we load dataset of top Premier League goal scorers from the CSV file provided. We will use the player name as the index columns

In [12]:
df = pd.read_csv("../data/goal_scorers.csv",index_col="Player")
df

                         Team  Total Goals  Penalties  Home Goals  Away Goals
Player
J Vardy        Leicester City           19          4          11           8
H Kane              Tottenham           16          4           7           9
R Lukaku              Everton           16          1           8           8
O Ighalo              Watford           15          0           8           7
S Aguero      Manchester City           14          1          10           4
R Mahrez       Leicester City           14          4           4          10
O Giroud              Arsenal           12          0           4           8
D Costa               Chelsea           10          0           7           3
J Defoe            Sunderland           10          0           3           7
G Wijnaldum     Newcastle Utd            9          0           9           0
T Deeney              Watford            8          5           2           6
R Barkley             Everton            8          2           5           3
A Ayew           Swansea City            8          0           5           3
G Sigurdsson     Swansea City            7          3           2           5
W Rooney       Manchester Utd            7          1           3           4
A Martial      Manchester Utd            7          0           4           3
D Alli              Tottenham            7          0           1           6
D Payet          West Ham Utd            7          0           3           4
M Arnautovic       Stoke City            7          2           4           3
Y Toure       Manchester City            7          0           3           4

Let's group the players based on the team that they play for (i.e the column with index "Team"):

In [13]:
groups = df.groupby("Team")

We can now sum over the values for each team to get the total for each column:

In [14]:
groups.sum()

                 Total Goals  Penalties  Home Goals  Away Goals
Team
Arsenal                   12          0           4           8
Chelsea                   10          0           7           3
Everton                   24          3          13          11
Leicester City            33          8          15          18
Manchester City           21          1          13           8
Manchester Utd            14          1           7           7
Newcastle Utd              9          0           9           0
Stoke City                 7          2           4           3
Sunderland                10          0           3           7
Swansea City              15          3           7           8
Tottenham                 23          4           8          15
Watford                   23          5          10          13
West Ham Utd               7          0           3           4

We could also have calculated the mean goals per team:

In [15]:
groups.mean()

                 Total Goals  Penalties  Home Goals  Away Goals
Team
Arsenal                 12.0        0.0         4.0         8.0
Chelsea                 10.0        0.0         7.0         3.0
Everton                 12.0        1.5         6.5         5.5
Leicester City          16.5        4.0         7.5         9.0
Manchester City         10.5        0.5         6.5         4.0
Manchester Utd           7.0        0.5         3.5         3.5
Newcastle Utd            9.0        0.0         9.0         0.0
Stoke City               7.0        2.0         4.0         3.0
Sunderland              10.0        0.0         3.0         7.0
Swansea City             7.5        1.5         3.5         4.0
Tottenham               11.5        2.0         4.0         7.5
Watford                 11.5        2.5         5.0         6.5
West Ham Utd             7.0        0.0         3.0         4.0

### Handling Missing Values

Many real datasets have missing values, either because it exists and was not collected or it never existed. When we load the dataset titanic.csv dataset, we see that some columns have many missing values - i.e. they contain the null/empty value *NaN*.

In [17]:
df = pd.read_csv("../data/titanic.csv")

In [18]:
df.shape

(418, 11)

In [19]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

One option is to simply drop a feature with many missing values. So we could drop the "Age" column using the *drop()* function:

In [22]:
df.drop(["Age"], axis=1)

,PassengerId,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,2,0,A/4 48871,24.1500,NaN,S
10,902,3,"Ilieff, Mr. Ylio",male,0,0,349220,7.8958,NaN,S
11,903,1,"Jones, Mr. Charles Cresson",male,0,0,694,26.0000,NaN,S
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,1,0,21228,82.2667,B45,S
13,905,2,"Howard, Mr. Benjamin",male,1,0,24065,26.0000,NaN,S
14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,1,0,W.E.P. 5734,61.1750,E31,S
15,907,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,1,0,SC/PARIS 2167,27.7208,NaN,C
16,908,2,"Keane, Mr. Daniel",male,0,0,233734,12.3500,NaN,Q
17,909,3,"Assaf, Mr. Gerios",male,0,0,2692,7.2250,NaN,C
18,910,3,"Ilmakangas, Miss. Ida Livija",female,1,0,STON/O2. 3101270,7.9250,NaN,S
19,911,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,0,0,2696,7.2250,NaN,C
20,912,1,"Rothschild, Mr. Martin",male,1,0,PC 17603,59.4000,NaN,C
21,913,3,"Olsen, Master. Artur Karl",male,0,1,C 17368,3.1708,NaN,S
22,914,1,"Flegenheim, Mrs. Alfred (Antoinette)",female,0,0,PC 17598,31.6833,NaN,S
23,915,1,"Williams, Mr. Richard Norris II",male,0,1,PC 17597,61.3792,NaN,C
24,916,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
25,917,3,"Robins, Mr. Alexander A",male,1,0,A/5. 3337,14.5000,NaN,S
26,918,1,"Ostby, Miss. Helene Ragnhild",female,0,1,113509,61.9792,B36,C
27,919,3,"Daher, Mr. Shedid",male,0,0,2698,7.2250,NaN,C
28,920,1,"Brady, Mr. John Bertram",male,0,0,113054,30.5000,A21,S
29,921,3,"Samaan, Mr. Elias",male,2,0,2662,21.6792,NaN,C
...,...,...,...,...,...,...,...,...,...,...
388,1280,3,"Canavan, Mr. Patrick",male,0,0,364858,7.7500,NaN,Q
389,1281,3,"Palsson, Master. Paul Folke",male,3,1,349909,21.0750,NaN,S
390,1282,1,"Payne, Mr. Vivian Ponsonby",male,0,0,12749,93.5000,B24,S
391,1283,1,"Lines, Mrs. Ernest H (Elizabeth Lindsey James)",female,0,1,PC 17592,39.4000,D28,S
392,1284,3,"Abbott, Master. Eugene Joseph",male,0,2,C.A. 2673,20.2500,NaN,S
393,1285,2,"Gilbert, Mr. William",male,0,0,C.A. 30769,10.5000,NaN,S
394,1286,3,"Kink-Heilmann, Mr. Anton",male,3,1,315153,22.0250,NaN,S
395,1287,1,"Smith, Mrs. Lucien Philip (Mary Eloise Hughes)",female,1,0,13695,60.0000,C31,S
396,1288,3,"Colbert, Mr. Patrick",male,0,0,371109,7.2500,NaN,Q
397,1289,1,"Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...",female,1,1,13567,79.2000,B41,C
398,1290,3,"Larsson-Rondberg, Mr. Edvard A",male,0,0,347065,7.7750,NaN,S
399,1291,3,"Conlon, Mr. Thomas Henry",male,0,0,21332,7.7333,NaN,Q
400,1292,1,"Bonnell, Miss. Caroline",female,0,0,36928,164.8667,C7,S
401,1293,2,"Gale, Mr. Harry",male,1,0,28664,21.0000,NaN,S
402,1294,1,"Gibson, Miss. Dorothy Winifred",female,0,1,112378,59.4000,NaN,C
403,1295,1,"Carrau, Mr. Jose Pedro",male,0,0,113059,47.1000,NaN,S
404,1296,1,"Frauenthal, Mr. Isaac Gerald",male,1,0,17765,27.7208,D40,C
405,1297,2,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male,0,0,SC/PARIS 2166,13.8625,D38,C
406,1298,2,"Ware, Mr. William Jeffery",male,1,0,28666,10.5000,NaN,S
407,1299,1,"Widener, Mr. George Dunton",male,1,1,113503,211.5000,C80,C
408,1300,3,"Riordan, Miss. Johanna Hannah""""",female,0,0,334915,7.7208,NaN,Q
409,1301,3,"Peacock, Miss. Treasteall",female,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
410,1302,3,"Naughton, Miss. Hannah",female,0,0,365237,7.7500,NaN,Q
411,1303,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,1,0,19928,90.0000,C78,Q
412,1304,3,"Henriksson, Miss. Jenny Lovisa",female,0,0,347086,7.7750,NaN,S
413,1305,3,"Spector, Mr. Woolf",male,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,1,1,2668,22.3583,NaN,C

However, if we expect age to play an important role, then we want to keep the column and estimate the missing values in some way.
A simple approach is to fill in missing values using the mean value.

In [23]:
mean_age = df["Age"].mean()
mean_age

30.272590361445783

In [24]:
# Replace all NaN values in the Age column with the mean value
df["Age"] = df["Age"].fillna(mean_age)
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.50000,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.00000,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.00000,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.00000,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.00000,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.00000,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.00000,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.00000,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.00000,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.00000,2,0,A/4 48871,24.1500,NaN,S
10,902,3,"Ilieff, Mr. Ylio",male,30.27259,0,0,349220,7.8958,NaN,S
11,903,1,"Jones, Mr. Charles Cresson",male,46.00000,0,0,694,26.0000,NaN,S
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.00000,1,0,21228,82.2667,B45,S
13,905,2,"Howard, Mr. Benjamin",male,63.00000,1,0,24065,26.0000,NaN,S
14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.00000,1,0,W.E.P. 5734,61.1750,E31,S
15,907,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24.00000,1,0,SC/PARIS 2167,27.7208,NaN,C
16,908,2,"Keane, Mr. Daniel",male,35.00000,0,0,233734,12.3500,NaN,Q
17,909,3,"Assaf, Mr. Gerios",male,21.00000,0,0,2692,7.2250,NaN,C
18,910,3,"Ilmakangas, Miss. Ida Livija",female,27.00000,1,0,STON/O2. 3101270,7.9250,NaN,S
19,911,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,45.00000,0,0,2696,7.2250,NaN,C
20,912,1,"Rothschild, Mr. Martin",male,55.00000,1,0,PC 17603,59.4000,NaN,C
21,913,3,"Olsen, Master. Artur Karl",male,9.00000,0,1,C 17368,3.1708,NaN,S
22,914,1,"Flegenheim, Mrs. Alfred (Antoinette)",female,30.27259,0,0,PC 17598,31.6833,NaN,S
23,915,1,"Williams, Mr. Richard Norris II",male,21.00000,0,1,PC 17597,61.3792,NaN,C
24,916,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.00000,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
25,917,3,"Robins, Mr. Alexander A",male,50.00000,1,0,A/5. 3337,14.5000,NaN,S
26,918,1,"Ostby, Miss. Helene Ragnhild",female,22.00000,0,1,113509,61.9792,B36,C
27,919,3,"Daher, Mr. Shedid",male,22.50000,0,0,2698,7.2250,NaN,C
28,920,1,"Brady, Mr. John Bertram",male,41.00000,0,0,113054,30.5000,A21,S
29,921,3,"Samaan, Mr. Elias",male,30.27259,2,0,2662,21.6792,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
388,1280,3,"Canavan, Mr. Patrick",male,21.00000,0,0,364858,7.7500,NaN,Q
389,1281,3,"Palsson, Master. Paul Folke",male,6.00000,3,1,349909,21.0750,NaN,S
390,1282,1,"Payne, Mr. Vivian Ponsonby",male,23.00000,0,0,12749,93.5000,B24,S
391,1283,1,"Lines, Mrs. Ernest H (Elizabeth Lindsey James)",female,51.00000,0,1,PC 17592,39.4000,D28,S
392,1284,3,"Abbott, Master. Eugene Joseph",male,13.00000,0,2,C.A. 2673,20.2500,NaN,S
393,1285,2,"Gilbert, Mr. William",male,47.00000,0,0,C.A. 30769,10.5000,NaN,S
394,1286,3,"Kink-Heilmann, Mr. Anton",male,29.00000,3,1,315153,22.0250,NaN,S
395,1287,1,"Smith, Mrs. Lucien Philip (Mary Eloise Hughes)",female,18.00000,1,0,13695,60.0000,C31,S
396,1288,3,"Colbert, Mr. Patrick",male,24.00000,0,0,371109,7.2500,NaN,Q
397,1289,1,"Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...",female,48.00000,1,1,13567,79.2000,B41,C
398,1290,3,"Larsson-Rondberg, Mr. Edvard A",male,22.00000,0,0,347065,7.7750,NaN,S
399,1291,3,"Conlon, Mr. Thomas Henry",male,31.00000,0,0,21332,7.7333,NaN,Q
400,1292,1,"Bonnell, Miss. Caroline",female,30.00000,0,0,36928,164.8667,C7,S
401,1293,2,"Gale, Mr. Harry",male,38.00000,1,0,28664,21.0000,NaN,S
402,1294,1,"Gibson, Miss. Dorothy Winifred",female,22.00000,0,1,112378,59.4000,NaN,C
403,1295,1,"Carrau, Mr. Jose Pedro",male,17.00000,0,0,113059,47.1000,NaN,S
404,1296,1,"Frauenthal, Mr. Isaac Gerald",male,43.00000,1,0,17765,27.7208,D40,C
405,1297,2,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male,20.00000,0,0,SC/PARIS 2166,13.8625,D38,C
406,1298,2,"Ware, Mr. William Jeffery",male,23.00000,1,0,28666,10.5000,NaN,S
407,1299,1,"Widener, Mr. George Dunton",male,50.00000,1,1,113503,211.5000,C80,C
408,1300,3,"Riordan, Miss. Johanna Hannah""""",female,30.27259,0,0,334915,7.7208,NaN,Q
409,1301,3,"Peacock, Miss. Treasteall",female,3.00000,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
410,1302,3,"Naughton, Miss. Hannah",female,30.27259,0,0,365237,7.7500,NaN,Q
411,1303,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.00000,1,0,19928,90.0000,C78,Q
412,1304,3,"Henriksson, Miss. Jenny Lovisa",female,28.00000,0,0,347086,7.7750,NaN,S
413,1305,3,"Spector, Mr. Woolf",male,30.27259,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.50000,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,30.27259,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,30.27259,1,1,2668,22.3583,NaN,C

Confirm that the "Age" column no longer has any missing values:

In [25]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64